{"weightsManifest": [{"weights": [{"shape": [5], "dtype": "float32", "name": "batch_normalization_1/gamma"}, {"shape": [5], "dtype": "float32", "name": "batch_normalization_1/beta"}, {"shape": [5], "dtype": "float32", "name": "batch_normalization_1/moving_mean"}, {"shape": [5], "dtype": "float32", "name": "batch_normalization_1/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_10/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_10/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_10/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_10/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_11/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_11/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_11/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_11/moving_variance"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_12/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_12/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_12/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_12/moving_variance"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_13/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_13/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_13/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_13/moving_variance"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_14/gamma"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_14/beta"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_14/moving_mean"}, {"shape": [128], "dtype": "float32", "name": "batch_normalization_14/moving_variance"}, {"shape": [8], "dtype": "float32", "name": "batch_normalization_2/gamma"}, {"shape": [8], "dtype": "float32", "name": "batch_normalization_2/beta"}, {"shape": [8], "dtype": "float32", "name": "batch_normalization_2/moving_mean"}, {"shape": [8], "dtype": "float32", "name": "batch_normalization_2/moving_variance"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_3/gamma"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_3/beta"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_3/moving_mean"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_3/moving_variance"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_4/gamma"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_4/beta"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_4/moving_mean"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_4/moving_variance"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_5/gamma"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_5/beta"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_5/moving_mean"}, {"shape": [16], "dtype": "float32", "name": "batch_normalization_5/moving_variance"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_6/moving_variance"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_7/moving_variance"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/gamma"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/beta"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/moving_mean"}, {"shape": [32], "dtype": "float32", "name": "batch_normalization_8/moving_variance"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_9/gamma"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_9/beta"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_9/moving_mean"}, {"shape": [64], "dtype": "float32", "name": "batch_normalization_9/moving_variance"}, {"shape": [3, 3, 1, 5], "dtype": "float32", "name": "conv2d_1/kernel"}, {"shape": [3, 3, 5, 8], "dtype": "float32", "name": "conv2d_2/kernel"}, {"shape": [1, 1, 8, 16], "dtype": "float32", "name": "conv2d_3/kernel"}, {"shape": [1, 1, 16, 32], "dtype": "float32", "name": "conv2d_4/kernel"}, {"shape": [1, 1, 32, 64], "dtype": "float32", "name": "conv2d_5/kernel"}, {"shape": [1, 1, 64, 128], "dtype": "float32", "name": "conv2d_6/kernel"}, {"shape": [3, 3, 128, 7], "dtype": "float32", "name": "conv2d_7/kernel"}, {"shape": [7], "dtype": "float32", "name": "conv2d_7/bias"}, {"shape": [3, 3, 8, 1], "dtype": "float32", "name": "separable_conv2d_1/depthwise_kernel"}, {"shape": [1, 1, 8, 16], "dtype": "float32", "name": "separable_conv2d_1/pointwise_kernel"}, {"shape": [3, 3, 16, 1], "dtype": "float32", "name": "separable_conv2d_2/depthwise_kernel"}, {"shape": [1, 1, 16, 16], "dtype": "float32", "name": "separable_conv2d_2/pointwise_kernel"}, {"shape": [3, 3, 16, 1], "dtype": "float32", "name": "separable_conv2d_3/depthwise_kernel"}, {"shape": [1, 1, 16, 32], "dtype": "float32", "name": "separable_conv2d_3/pointwise_kernel"}, {"shape": [3, 3, 32, 1], "dtype": "float32", "name": "separable_conv2d_4/depthwise_kernel"}, {"shape": [1, 1, 32, 32], "dtype": "float32", "name": "separable_conv2d_4/pointwise_kernel"}, {"shape": [3, 3, 32, 1], "dtype": "float32", "name": "separable_conv2d_5/depthwise_kernel"}, {"shape": [1, 1, 32, 64], "dtype": "float32", "name": "separable_conv2d_5/pointwise_kernel"}, {"shape": [3, 3, 64, 1], "dtype": "float32", "name": "separable_conv2d_6/depthwise_kernel"}, {"shape": [1, 1, 64, 64], "dtype": "float32", "name": "separable_conv2d_6/pointwise_kernel"}, {"shape": [3, 3, 64, 1], "dtype": "float32", "name": "separable_conv2d_7/depthwise_kernel"}, {"shape": [1, 1, 64, 128], "dtype": "float32", "name": "separable_conv2d_7/pointwise_kernel"}, {"shape": [3, 3, 128, 1], "dtype": "float32", "name": "separable_conv2d_8/depthwise_kernel"}, {"shape": [1, 1, 128, 128], "dtype": "float32", "name": "separable_conv2d_8/pointwise_kernel"}], "paths": ["group1-shard1of1"]}], "modelTopology": {"keras_version": "2.0.5", "training_config": {"metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null, "loss": "categorical_crossentropy", "optimizer_config": {"config": {"lr": 1.0000000656873453e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08}, "class_name": "Adam"}}, "backend": "tensorflow", "model_config": {"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 48, 48, 1], "sparse": false, "dtype": "float32", "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"filters": 5, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": false, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"config": {"filters": 8, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": false, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"config": {"filters": 16, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_1", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "separable_conv2d_1"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_4"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_3"}, {"config": {"filters": 16, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_2", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "separable_conv2d_2"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "name": "batch_normalization_5"}, {"config": {"filters": 16, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [3, 3], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1"}, {"config": {"filters": 32, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_3", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "separable_conv2d_3"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "name": "batch_normalization_7"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_4"}, {"config": {"filters": 32, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_4", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "separable_conv2d_4"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "name": "batch_normalization_8"}, {"config": {"filters": 32, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "pool_size": [3, 3], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_6"}, {"config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]], "name": "add_2"}, {"config": {"filters": 64, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_5", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "separable_conv2d_5"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "name": "batch_normalization_10"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_5"}, {"config": {"filters": 64, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_6", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "separable_conv2d_6"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "name": "batch_normalization_11"}, {"config": {"filters": 64, "strides": [2, 2], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "pool_size": [3, 3], "padding": "same", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "max_pooling2d_3"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_9"}, {"config": {"trainable": true, "name": "add_3"}, "class_name": "Add", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_3"}, {"config": {"filters": 128, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_7", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "separable_conv2d_7"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_13", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "name": "batch_normalization_13"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_6"}, {"config": {"filters": 128, "pointwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "separable_conv2d_8", "bias_constraint": null, "depthwise_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "data_format": "channels_last", "depth_multiplier": 1, "kernel_size": [3, 3], "pointwise_constraint": null, "strides": [1, 1], "depthwise_regularizer": null, "trainable": true, "bias_regularizer": null, "depthwise_constraint": null, "pointwise_regularizer": null, "use_bias": false, "activation": "linear"}, "class_name": "SeparableConv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "separable_conv2d_8"}, {"config": {"filters": 128, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_6", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_14", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "name": "batch_normalization_14"}, {"config": {"gamma_regularizer": null, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_12", "gamma_constraint": null, "beta_regularizer": null, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_12"}, {"config": {"trainable": true, "name": "add_4"}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "name": "add_4"}, {"config": {"filters": 7, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "conv2d_7", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "global_average_pooling2d_1"}, {"config": {"activation": "softmax", "trainable": true, "name": "predictions"}, "class_name": "Activation", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "predictions"}], "name": "model_1"}, "class_name": "Model"}}}